; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-u-4)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite6 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	infrared1 - mode
	thermograph2 - mode
	infrared0 - mode
	Star0 - direction
	Star2 - direction
	GroundStation1 - direction
	Planet3 - direction
	Star4 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
	Planet19 - direction
	Phenomenon20 - direction
	Planet21 - direction
	Star22 - direction
	Star23 - direction
	Planet24 - direction
	Planet25 - direction
	Phenomenon26 - direction
	Star27 - direction
	Planet28 - direction
	Planet29 - direction
	Star30 - direction
	Star31 - direction
	Planet32 - direction
	Phenomenon33 - direction
	Phenomenon34 - direction
	Star35 - direction
	Planet36 - direction
	Star37 - direction
	Star38 - direction
	Planet39 - direction
	Star40 - direction
	Planet41 - direction
	Planet42 - direction
	Phenomenon43 - direction
	Planet44 - direction
	Phenomenon45 - direction
	Phenomenon46 - direction
	Phenomenon47 - direction
	Planet48 - direction
	Planet49 - direction
	Planet50 - direction
	Phenomenon51 - direction
	Phenomenon52 - direction
	Star53 - direction
	Star54 - direction
	Phenomenon55 - direction
	Planet56 - direction
	Phenomenon57 - direction
	Star58 - direction
	Star59 - direction
	Phenomenon60 - direction
	Phenomenon61 - direction
	Phenomenon62 - direction
	Planet63 - direction
	Planet64 - direction
	Star65 - direction
	Star66 - direction
	Planet67 - direction
	Planet68 - direction
	Phenomenon69 - direction
	Star70 - direction
	Planet71 - direction
	Phenomenon72 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared0)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet21)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star0)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star2)
	(supports instrument5 thermograph2)
	(supports instrument5 infrared0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star17)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon8)
	(supports instrument8 thermograph2)
	(supports instrument8 infrared1)
	(supports instrument8 infrared0)
	(calibration_target instrument8 Star0)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet24)
	(supports instrument9 infrared0)
	(supports instrument9 infrared1)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 Star0)
	(supports instrument10 infrared1)
	(supports instrument10 infrared0)
	(calibration_target instrument10 Star0)
	(supports instrument11 infrared0)
	(supports instrument11 infrared1)
	(supports instrument11 thermograph2)
	(calibration_target instrument11 GroundStation1)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet5)
	(supports instrument12 infrared0)
	(calibration_target instrument12 GroundStation1)
	(supports instrument13 thermograph2)
	(calibration_target instrument13 Star2)
	(supports instrument14 infrared0)
	(supports instrument14 thermograph2)
	(supports instrument14 infrared1)
	(calibration_target instrument14 GroundStation1)
	(on_board instrument12 satellite6)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Planet24)
)
(:goal (and
	(pointing satellite0 Planet29)
	(pointing satellite1 GroundStation1)
	(pointing satellite5 Phenomenon69)
	(pointing satellite6 Planet68)
	(have_image Planet3 infrared1)
	(have_image Star4 infrared1)
	(have_image Planet5 thermograph2)
	(have_image Star6 infrared1)
	(have_image Star7 infrared0)
	(have_image Phenomenon8 thermograph2)
	(have_image Phenomenon9 infrared0)
	(have_image Planet10 infrared0)
	(have_image Planet11 infrared1)
	(have_image Planet12 thermograph2)
	(have_image Phenomenon14 infrared0)
	(have_image Phenomenon15 infrared0)
	(have_image Planet16 infrared1)
	(have_image Planet18 infrared0)
	(have_image Planet19 infrared0)
	(have_image Phenomenon20 infrared1)
	(have_image Planet21 infrared0)
	(have_image Star22 infrared1)
	(have_image Star23 thermograph2)
	(have_image Planet24 infrared1)
	(have_image Planet25 infrared0)
	(have_image Phenomenon26 thermograph2)
	(have_image Star27 infrared0)
	(have_image Planet28 infrared0)
	(have_image Planet29 infrared0)
	(have_image Star30 infrared1)
	(have_image Planet32 thermograph2)
	(have_image Phenomenon33 infrared0)
	(have_image Phenomenon34 infrared1)
	(have_image Star35 thermograph2)
	(have_image Planet36 infrared0)
	(have_image Star37 thermograph2)
	(have_image Star38 thermograph2)
	(have_image Planet39 infrared1)
	(have_image Star40 thermograph2)
	(have_image Planet41 thermograph2)
	(have_image Planet42 infrared0)
	(have_image Phenomenon43 thermograph2)
	(have_image Planet44 infrared1)
	(have_image Phenomenon45 thermograph2)
	(have_image Phenomenon46 infrared0)
	(have_image Phenomenon47 infrared0)
	(have_image Planet48 thermograph2)
	(have_image Planet49 thermograph2)
	(have_image Planet50 thermograph2)
	(have_image Phenomenon51 thermograph2)
	(have_image Phenomenon52 infrared1)
	(have_image Star53 infrared1)
	(have_image Star54 infrared0)
	(have_image Phenomenon55 thermograph2)
	(have_image Planet56 thermograph2)
	(have_image Phenomenon57 thermograph2)
	(have_image Star58 infrared1)
	(have_image Star59 thermograph2)
	(have_image Phenomenon60 infrared0)
	(have_image Phenomenon61 thermograph2)
	(have_image Phenomenon62 infrared0)
	(have_image Planet63 thermograph2)
	(have_image Planet64 infrared0)
	(have_image Star65 infrared1)
	(have_image Planet67 thermograph2)
	(have_image Planet68 infrared0)
	(have_image Phenomenon69 infrared0)
	(have_image Star70 infrared1)
	(have_image Planet71 infrared1)
	(have_image Phenomenon72 infrared0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 70
2. (turn_to satellite0 star2 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 star2)
   goals met: 0 of 70
3. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 70
4. (turn_to satellite0 phenomenon14 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 70
5. (take_image satellite0 phenomenon14 instrument0 infrared0)
   added: (have_image phenomenon14 infrared0)
   goals met: 1 of 70
6. (turn_to satellite0 phenomenon15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 70
7. (take_image satellite0 phenomenon15 instrument0 infrared0)
   added: (have_image phenomenon15 infrared0)
   goals met: 2 of 70
8. (turn_to satellite0 phenomenon20 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon20)
   goals met: 2 of 70
9. (take_image satellite0 phenomenon20 instrument0 infrared1)
   added: (have_image phenomenon20 infrared1)
   goals met: 3 of 70
10. (turn_to satellite0 phenomenon26 phenomenon20)
   deleted: (pointing satellite0 phenomenon20)
   added: (pointing satellite0 phenomenon26)
   goals met: 3 of 70
11. (take_image satellite0 phenomenon26 instrument0 thermograph2)
   added: (have_image phenomenon26 thermograph2)
   goals met: 4 of 70
12. (turn_to satellite0 phenomenon33 phenomenon26)
   deleted: (pointing satellite0 phenomenon26)
   added: (pointing satellite0 phenomenon33)
   goals met: 4 of 70
13. (take_image satellite0 phenomenon33 instrument0 infrared0)
   added: (have_image phenomenon33 infrared0)
   goals met: 5 of 70
14. (turn_to satellite0 phenomenon34 phenomenon33)
   deleted: (pointing satellite0 phenomenon33)
   added: (pointing satellite0 phenomenon34)
   goals met: 5 of 70
15. (take_image satellite0 phenomenon34 instrument0 infrared1)
   added: (have_image phenomenon34 infrared1)
   goals met: 6 of 70
16. (turn_to satellite0 phenomenon43 phenomenon34)
   deleted: (pointing satellite0 phenomenon34)
   added: (pointing satellite0 phenomenon43)
   goals met: 6 of 70
17. (take_image satellite0 phenomenon43 instrument0 thermograph2)
   added: (have_image phenomenon43 thermograph2)
   goals met: 7 of 70
18. (turn_to satellite0 phenomenon45 phenomenon43)
   deleted: (pointing satellite0 phenomenon43)
   added: (pointing satellite0 phenomenon45)
   goals met: 7 of 70
19. (take_image satellite0 phenomenon45 instrument0 thermograph2)
   added: (have_image phenomenon45 thermograph2)
   goals met: 8 of 70
20. (turn_to satellite0 phenomenon46 phenomenon45)
   deleted: (pointing satellite0 phenomenon45)
   added: (pointing satellite0 phenomenon46)
   goals met: 8 of 70
21. (take_image satellite0 phenomenon46 instrument0 infrared0)
   added: (have_image phenomenon46 infrared0)
   goals met: 9 of 70
22. (turn_to satellite0 phenomenon47 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 phenomenon47)
   goals met: 9 of 70
23. (take_image satellite0 phenomenon47 instrument0 infrared0)
   added: (have_image phenomenon47 infrared0)
   goals met: 10 of 70
24. (turn_to satellite0 phenomenon51 phenomenon47)
   deleted: (pointing satellite0 phenomenon47)
   added: (pointing satellite0 phenomenon51)
   goals met: 10 of 70
25. (take_image satellite0 phenomenon51 instrument0 thermograph2)
   added: (have_image phenomenon51 thermograph2)
   goals met: 11 of 70
26. (turn_to satellite0 phenomenon52 phenomenon51)
   deleted: (pointing satellite0 phenomenon51)
   added: (pointing satellite0 phenomenon52)
   goals met: 11 of 70
27. (take_image satellite0 phenomenon52 instrument0 infrared1)
   added: (have_image phenomenon52 infrared1)
   goals met: 12 of 70
28. (turn_to satellite0 phenomenon55 phenomenon52)
   deleted: (pointing satellite0 phenomenon52)
   added: (pointing satellite0 phenomenon55)
   goals met: 12 of 70
29. (take_image satellite0 phenomenon55 instrument0 thermograph2)
   added: (have_image phenomenon55 thermograph2)
   goals met: 13 of 70
30. (turn_to satellite0 phenomenon57 phenomenon55)
   deleted: (pointing satellite0 phenomenon55)
   added: (pointing satellite0 phenomenon57)
   goals met: 13 of 70
31. (take_image satellite0 phenomenon57 instrument0 thermograph2)
   added: (have_image phenomenon57 thermograph2)
   goals met: 14 of 70
32. (turn_to satellite0 phenomenon60 phenomenon57)
   deleted: (pointing satellite0 phenomenon57)
   added: (pointing satellite0 phenomenon60)
   goals met: 14 of 70
33. (take_image satellite0 phenomenon60 instrument0 infrared0)
   added: (have_image phenomenon60 infrared0)
   goals met: 15 of 70
34. (turn_to satellite0 phenomenon61 phenomenon60)
   deleted: (pointing satellite0 phenomenon60)
   added: (pointing satellite0 phenomenon61)
   goals met: 15 of 70
35. (take_image satellite0 phenomenon61 instrument0 thermograph2)
   added: (have_image phenomenon61 thermograph2)
   goals met: 16 of 70
36. (turn_to satellite0 phenomenon62 phenomenon61)
   deleted: (pointing satellite0 phenomenon61)
   added: (pointing satellite0 phenomenon62)
   goals met: 16 of 70
37. (take_image satellite0 phenomenon62 instrument0 infrared0)
   added: (have_image phenomenon62 infrared0)
   goals met: 17 of 70
38. (turn_to satellite0 phenomenon69 phenomenon62)
   deleted: (pointing satellite0 phenomenon62)
   added: (pointing satellite0 phenomenon69)
   goals met: 17 of 70
39. (take_image satellite0 phenomenon69 instrument0 infrared0)
   added: (have_image phenomenon69 infrared0)
   goals met: 18 of 70
40. (turn_to satellite0 phenomenon72 phenomenon69)
   deleted: (pointing satellite0 phenomenon69)
   added: (pointing satellite0 phenomenon72)
   goals met: 18 of 70
41. (take_image satellite0 phenomenon72 instrument0 infrared0)
   added: (have_image phenomenon72 infrared0)
   goals met: 19 of 70
42. (turn_to satellite0 phenomenon8 phenomenon72)
   deleted: (pointing satellite0 phenomenon72)
   added: (pointing satellite0 phenomenon8)
   goals met: 19 of 70
43. (take_image satellite0 phenomenon8 instrument0 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 20 of 70
44. (turn_to satellite0 phenomenon9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon9)
   goals met: 20 of 70
45. (take_image satellite0 phenomenon9 instrument0 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 21 of 70
46. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 21 of 70
47. (take_image satellite0 planet10 instrument0 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 22 of 70
48. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   goals met: 22 of 70
49. (take_image satellite0 planet11 instrument0 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 23 of 70
50. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 23 of 70
51. (take_image satellite0 planet12 instrument0 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 24 of 70
52. (turn_to satellite0 planet16 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet16)
   goals met: 24 of 70
53. (take_image satellite0 planet16 instrument0 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 25 of 70
54. (turn_to satellite0 planet18 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet18)
   goals met: 25 of 70
55. (take_image satellite0 planet18 instrument0 infrared0)
   added: (have_image planet18 infrared0)
   goals met: 26 of 70
56. (turn_to satellite0 planet19 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet19)
   goals met: 26 of 70
57. (take_image satellite0 planet19 instrument0 infrared0)
   added: (have_image planet19 infrared0)
   goals met: 27 of 70
58. (turn_to satellite0 planet21 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 planet21)
   goals met: 27 of 70
59. (take_image satellite0 planet21 instrument0 infrared0)
   added: (have_image planet21 infrared0)
   goals met: 28 of 70
60. (turn_to satellite0 planet24 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 planet24)
   goals met: 28 of 70
61. (take_image satellite0 planet24 instrument0 infrared1)
   added: (have_image planet24 infrared1)
   goals met: 29 of 70
62. (turn_to satellite0 planet25 planet24)
   deleted: (pointing satellite0 planet24)
   added: (pointing satellite0 planet25)
   goals met: 29 of 70
63. (take_image satellite0 planet25 instrument0 infrared0)
   added: (have_image planet25 infrared0)
   goals met: 30 of 70
64. (turn_to satellite0 planet28 planet25)
   deleted: (pointing satellite0 planet25)
   added: (pointing satellite0 planet28)
   goals met: 30 of 70
65. (take_image satellite0 planet28 instrument0 infrared0)
   added: (have_image planet28 infrared0)
   goals met: 31 of 70
66. (turn_to satellite0 planet29 planet28)
   deleted: (pointing satellite0 planet28)
   added: (pointing satellite0 planet29)
   goals met: 32 of 70
67. (take_image satellite0 planet29 instrument0 infrared0)
   added: (have_image planet29 infrared0)
   goals met: 33 of 70
68. (turn_to satellite0 planet3 planet29)
   deleted: (pointing satellite0 planet29)
   added: (pointing satellite0 planet3)
   goals met: 32 of 70
69. (take_image satellite0 planet3 instrument0 infrared1)
   added: (have_image planet3 infrared1)
   goals met: 33 of 70
70. (turn_to satellite0 planet32 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 planet32)
   goals met: 33 of 70
71. (take_image satellite0 planet32 instrument0 thermograph2)
   added: (have_image planet32 thermograph2)
   goals met: 34 of 70
72. (turn_to satellite0 planet36 planet32)
   deleted: (pointing satellite0 planet32)
   added: (pointing satellite0 planet36)
   goals met: 34 of 70
73. (take_image satellite0 planet36 instrument0 infrared0)
   added: (have_image planet36 infrared0)
   goals met: 35 of 70
74. (turn_to satellite0 planet39 planet36)
   deleted: (pointing satellite0 planet36)
   added: (pointing satellite0 planet39)
   goals met: 35 of 70
75. (take_image satellite0 planet39 instrument0 infrared1)
   added: (have_image planet39 infrared1)
   goals met: 36 of 70
76. (turn_to satellite0 planet41 planet39)
   deleted: (pointing satellite0 planet39)
   added: (pointing satellite0 planet41)
   goals met: 36 of 70
77. (take_image satellite0 planet41 instrument0 thermograph2)
   added: (have_image planet41 thermograph2)
   goals met: 37 of 70
78. (turn_to satellite0 planet42 planet41)
   deleted: (pointing satellite0 planet41)
   added: (pointing satellite0 planet42)
   goals met: 37 of 70
79. (take_image satellite0 planet42 instrument0 infrared0)
   added: (have_image planet42 infrared0)
   goals met: 38 of 70
80. (turn_to satellite0 planet44 planet42)
   deleted: (pointing satellite0 planet42)
   added: (pointing satellite0 planet44)
   goals met: 38 of 70
81. (take_image satellite0 planet44 instrument0 infrared1)
   added: (have_image planet44 infrared1)
   goals met: 39 of 70
82. (turn_to satellite0 planet48 planet44)
   deleted: (pointing satellite0 planet44)
   added: (pointing satellite0 planet48)
   goals met: 39 of 70
83. (take_image satellite0 planet48 instrument0 thermograph2)
   added: (have_image planet48 thermograph2)
   goals met: 40 of 70
84. (turn_to satellite0 planet49 planet48)
   deleted: (pointing satellite0 planet48)
   added: (pointing satellite0 planet49)
   goals met: 40 of 70
85. (take_image satellite0 planet49 instrument0 thermograph2)
   added: (have_image planet49 thermograph2)
   goals met: 41 of 70
86. (turn_to satellite0 planet5 planet49)
   deleted: (pointing satellite0 planet49)
   added: (pointing satellite0 planet5)
   goals met: 41 of 70
87. (take_image satellite0 planet5 instrument0 thermograph2)
   added: (have_image planet5 thermograph2)
   goals met: 42 of 70
88. (turn_to satellite0 planet50 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet50)
   goals met: 42 of 70
89. (take_image satellite0 planet50 instrument0 thermograph2)
   added: (have_image planet50 thermograph2)
   goals met: 43 of 70
90. (turn_to satellite0 planet56 planet50)
   deleted: (pointing satellite0 planet50)
   added: (pointing satellite0 planet56)
   goals met: 43 of 70
91. (take_image satellite0 planet56 instrument0 thermograph2)
   added: (have_image planet56 thermograph2)
   goals met: 44 of 70
92. (turn_to satellite0 planet63 planet56)
   deleted: (pointing satellite0 planet56)
   added: (pointing satellite0 planet63)
   goals met: 44 of 70
93. (take_image satellite0 planet63 instrument0 thermograph2)
   added: (have_image planet63 thermograph2)
   goals met: 45 of 70
94. (turn_to satellite0 planet64 planet63)
   deleted: (pointing satellite0 planet63)
   added: (pointing satellite0 planet64)
   goals met: 45 of 70
95. (take_image satellite0 planet64 instrument0 infrared0)
   added: (have_image planet64 infrared0)
   goals met: 46 of 70
96. (turn_to satellite0 planet67 planet64)
   deleted: (pointing satellite0 planet64)
   added: (pointing satellite0 planet67)
   goals met: 46 of 70
97. (take_image satellite0 planet67 instrument0 thermograph2)
   added: (have_image planet67 thermograph2)
   goals met: 47 of 70
98. (turn_to satellite0 planet68 planet67)
   deleted: (pointing satellite0 planet67)
   added: (pointing satellite0 planet68)
   goals met: 47 of 70
99. (take_image satellite0 planet68 instrument0 infrared0)
   added: (have_image planet68 infrared0)
   goals met: 48 of 70
100. (turn_to satellite0 planet71 planet68)
   deleted: (pointing satellite0 planet68)
   added: (pointing satellite0 planet71)
   goals met: 48 of 70
101. (take_image satellite0 planet71 instrument0 infrared1)
   added: (have_image planet71 infrared1)
   goals met: 49 of 70
102. (turn_to satellite0 star22 planet71)
   deleted: (pointing satellite0 planet71)
   added: (pointing satellite0 star22)
   goals met: 49 of 70
103. (take_image satellite0 star22 instrument0 infrared1)
   added: (have_image star22 infrared1)
   goals met: 50 of 70
104. (turn_to satellite0 star23 star22)
   deleted: (pointing satellite0 star22)
   added: (pointing satellite0 star23)
   goals met: 50 of 70
105. (take_image satellite0 star23 instrument0 thermograph2)
   added: (have_image star23 thermograph2)
   goals met: 51 of 70
106. (turn_to satellite0 star27 star23)
   deleted: (pointing satellite0 star23)
   added: (pointing satellite0 star27)
   goals met: 51 of 70
107. (take_image satellite0 star27 instrument0 infrared0)
   added: (have_image star27 infrared0)
   goals met: 52 of 70
108. (turn_to satellite0 star30 star27)
   deleted: (pointing satellite0 star27)
   added: (pointing satellite0 star30)
   goals met: 52 of 70
109. (take_image satellite0 star30 instrument0 infrared1)
   added: (have_image star30 infrared1)
   goals met: 53 of 70
110. (turn_to satellite0 star35 star30)
   deleted: (pointing satellite0 star30)
   added: (pointing satellite0 star35)
   goals met: 53 of 70
111. (take_image satellite0 star35 instrument0 thermograph2)
   added: (have_image star35 thermograph2)
   goals met: 54 of 70
112. (turn_to satellite0 star37 star35)
   deleted: (pointing satellite0 star35)
   added: (pointing satellite0 star37)
   goals met: 54 of 70
113. (take_image satellite0 star37 instrument0 thermograph2)
   added: (have_image star37 thermograph2)
   goals met: 55 of 70
114. (turn_to satellite0 star38 star37)
   deleted: (pointing satellite0 star37)
   added: (pointing satellite0 star38)
   goals met: 55 of 70
115. (take_image satellite0 star38 instrument0 thermograph2)
   added: (have_image star38 thermograph2)
   goals met: 56 of 70
116. (turn_to satellite0 star4 star38)
   deleted: (pointing satellite0 star38)
   added: (pointing satellite0 star4)
   goals met: 56 of 70
117. (take_image satellite0 star4 instrument0 infrared1)
   added: (have_image star4 infrared1)
   goals met: 57 of 70
118. (turn_to satellite0 star40 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star40)
   goals met: 57 of 70
119. (take_image satellite0 star40 instrument0 thermograph2)
   added: (have_image star40 thermograph2)
   goals met: 58 of 70
120. (turn_to satellite0 star53 star40)
   deleted: (pointing satellite0 star40)
   added: (pointing satellite0 star53)
   goals met: 58 of 70
121. (take_image satellite0 star53 instrument0 infrared1)
   added: (have_image star53 infrared1)
   goals met: 59 of 70
122. (turn_to satellite0 star54 star53)
   deleted: (pointing satellite0 star53)
   added: (pointing satellite0 star54)
   goals met: 59 of 70
123. (take_image satellite0 star54 instrument0 infrared0)
   added: (have_image star54 infrared0)
   goals met: 60 of 70
124. (turn_to satellite0 star58 star54)
   deleted: (pointing satellite0 star54)
   added: (pointing satellite0 star58)
   goals met: 60 of 70
125. (take_image satellite0 star58 instrument0 infrared1)
   added: (have_image star58 infrared1)
   goals met: 61 of 70
126. (turn_to satellite0 star59 star58)
   deleted: (pointing satellite0 star58)
   added: (pointing satellite0 star59)
   goals met: 61 of 70
127. (take_image satellite0 star59 instrument0 thermograph2)
   added: (have_image star59 thermograph2)
   goals met: 62 of 70
128. (turn_to satellite0 star6 star59)
   deleted: (pointing satellite0 star59)
   added: (pointing satellite0 star6)
   goals met: 62 of 70
129. (take_image satellite0 star6 instrument0 infrared1)
   added: (have_image star6 infrared1)
   goals met: 63 of 70
130. (turn_to satellite0 star65 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star65)
   goals met: 63 of 70
131. (take_image satellite0 star65 instrument0 infrared1)
   added: (have_image star65 infrared1)
   goals met: 64 of 70
132. (turn_to satellite0 star7 star65)
   deleted: (pointing satellite0 star65)
   added: (pointing satellite0 star7)
   goals met: 64 of 70
133. (take_image satellite0 star7 instrument0 infrared0)
   added: (have_image star7 infrared0)
   goals met: 65 of 70
134. (turn_to satellite0 star70 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star70)
   goals met: 65 of 70
135. (take_image satellite0 star70 instrument0 infrared1)
   added: (have_image star70 infrared1)
   goals met: 66 of 70
136. (turn_to satellite0 planet29 star70)
   deleted: (pointing satellite0 star70)
   added: (pointing satellite0 planet29)
   goals met: 67 of 70
137. (turn_to satellite1 groundstation1 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 groundstation1)
   goals met: 68 of 70
138. (turn_to satellite5 phenomenon69 planet5)
   deleted: (pointing satellite5 planet5)
   added: (pointing satellite5 phenomenon69)
   goals met: 69 of 70
139. (turn_to satellite6 planet68 planet24)
   deleted: (pointing satellite6 planet24)
   added: (pointing satellite6 planet68)
   goals met: 70 of 70
